# Daily Challenge: Data Handling and Analysis in Python

In [2]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler
from sklearn.decomposition import PCA

df = pd.read_csv("datascience_salaries.csv")
df.head()

,Unnamed: 0,job_title,job_type,experience_level,location,salary_currency,salary
0,0,Data scientist,Full Time,Senior,New York City,USD,149000
1,2,Data scientist,Full Time,Senior,Boston,USD,120000
2,3,Data scientist,Full Time,Senior,London,USD,68000
3,4,Data scientist,Full Time,Senior,Boston,USD,120000
4,5,Data scientist,Full Time,Senior,New York City,USD,149000

In [3]:
import os
print(os.getcwd())
print(os.listdir())

/Users/Ethan/DI172/Week5/Day6/DailyChallenge
['datascience_salaries.csv', '.DS_Store', 'Data_Handling.ipynb']

## Min-Max Normalization of Salary

In [4]:

scaler = MinMaxScaler()
df['salary_normalized'] = scaler.fit_transform(df[['salary']])
df[['salary', 'salary_normalized']].head()

   salary  salary_normalized
0  149000           0.601010
1  120000           0.454545
2   68000           0.191919
3  120000           0.454545
4  149000           0.601010

## Dimensionality Reduction with PCA

In [5]:

numeric_df = df.select_dtypes(include='number').dropna()

pca = PCA(n_components=2)
pca_result = pca.fit_transform(numeric_df)

pca_df = pd.DataFrame(pca_result, columns=['PC1', 'PC2'])
pca_df.head()

            PC1         PC2
0  84163.766081 -949.193183
1  55163.767131 -941.138351
2   3163.768472 -929.281412
3  55163.767548 -939.138352
4  84163.767125 -944.193183

## Salary Aggregation by Experience Level

In [6]:

salary_stats = df.groupby('experience_level')['salary'].agg(['mean', 'median'])
salary_stats

                          mean   median
experience_level
Entry             36111.111111  30000.0
Executive         76076.923077  46000.0
Mid               51786.885246  51000.0
Senior            75088.033012  68000.0